cfe llm/InformationRegisters/AI_ОчередьЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AI_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_СтатусОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусHTTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходныеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТулТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьПодготовкиКВекторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьПодготовкиКВекторизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_ОбработкаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаОчереди() Экспорт

	КоличествоПопытокОбработки = Константы.AI_КоличествоПопытокОбработкиЗапросаОчереди.Получить();
	Если КоличествоПопытокОбработки = 0 Тогда
		КоличествоПопытокОбработки = 5;
	КонецЕсли;

	КоличествоВсехПотоков = Константы.AI_КоличествоПотоковОбработкиОчереди.Получить();
	Если КоличествоВсехПотоков = 0 Тогда
		КоличествоВсехПотоков = 4;
	КонецЕсли;

	// Вернуть зависшие "ВОбработке" записи (старше 60 мин) обратно в статус "Новый"
	ВернутьЗависшиеЗаписи();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_ОчередьЗапросов.Дата КАК Дата,
		|	AI_ОчередьЗапросов.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	AI_ОчередьЗапросов.Провайдер.МаксКоличествоПотоков КАК ПровайдерМаксКоличествоПотоков,
		|	AI_ОчередьЗапросов.Провайдер.ЛимитRPM КАК ПровайдерЛимитRPM,
		|	AI_ОчередьЗапросов.Провайдер.ЛимитТокеновВСутки КАК ПровайдерЛимитТокеновВСутки,
		|	AI_ОчередьЗапросов.Провайдер КАК Провайдер
		|ИЗ
		|	РегистрСведений.AI_ОчередьЗапросов КАК AI_ОчередьЗапросов
		|ГДЕ
		|	AI_ОчередьЗапросов.Статус = &СтатусНовый
		|	И AI_ОчередьЗапросов.КоличествоОшибок < &МаксПопыток
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	МАКСИМУМ(ПровайдерМаксКоличествоПотоков),
		|	МАКСИМУМ(ПровайдерЛимитRPM),
		|	МАКСИМУМ(ПровайдерЛимитТокеновВСутки)
		|ПО
		|	Провайдер";

	Запрос.УстановитьПараметр("СтатусНовый", Перечисления.AI_СтатусОчереди.Новый);
	Запрос.УстановитьПараметр("МаксПопыток", КоличествоПопытокОбработки);

	ОбходПровайдеров = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	МассивПорций = Новый Массив;

	Пока ОбходПровайдеров.Следующий() Цикл

		ВыборкаЗапросов = ОбходПровайдеров.Выбрать();

		// Доступно ограничение из провайдера по количеству потоков
		ОграничениеПровайдераПоКоличествуПотоков = ОбходПровайдеров.ПровайдерМаксКоличествоПотоков;
		Если ОграничениеПровайдераПоКоличествуПотоков = 0
				ИЛИ ВыборкаЗапросов.Количество() <= 5 Тогда // Если меньше 5 запросов, то не имеет смысла в многопоточной обработке. IMHO
			ОграничениеПровайдераПоКоличествуПотоков = 1;
		КонецЕсли;

		// Лимит RPM: 0 = без ограничения
		ЛимитRPM = ОбходПровайдеров.ПровайдерЛимитRPM;

		// Лимит токенов в сутки: 0 = без ограничения
		ЛимитТокеновВСутки = ОбходПровайдеров.ПровайдерЛимитТокеновВСутки;
		Если ЛимитТокеновВСутки > 0 Тогда
			РасходЗаСегодня = ПолучитьРасходТокеновЗаСегодня(ОбходПровайдеров.Провайдер);
			Если РасходЗаСегодня >= ЛимитТокеновВСутки Тогда
				ЗаписьЖурналаРегистрации(
					"AI_ЛимитТокенов",
					УровеньЖурналаРегистрации.Предупреждение, , ОбходПровайдеров.Провайдер,
					СтрШаблон(
						"Превышен суточный лимит токенов: %1 из %2 — обработка провайдера пропущена",
						РасходЗаСегодня, ЛимитТокеновВСутки));
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		// Атомарно захватываем записи — в обработку уходят только успешно захваченные.
		// Если параллельный РЗ успел захватить запись первым — она пропускается.
		МассивЗахваченных = Новый Массив;
		Пока ВыборкаЗапросов.Следующий() Цикл
			// Соблюдаем лимит RPM провайдера (0 = без лимита)
			Если ЛимитRPM > 0 И МассивЗахваченных.Количество() >= ЛимитRPM Тогда
				Прервать;
			КонецЕсли;
			Если РегистрыСведений.AI_ОчередьЗапросов.ЗафиксироватьНачалоОбработки(
					ВыборкаЗапросов.УникальныйИдентификатор) Тогда
				МассивЗахваченных.Добавить(ВыборкаЗапросов.УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;

		Если МассивЗахваченных.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Разбивка захваченных записей на порции для фоновых заданий
		МассивПорции = Новый Массив;
		МаксКоличествоВПорции = Макс(1, Цел(МассивЗахваченных.Количество() / ОграничениеПровайдераПоКоличествуПотоков));

		Для Каждого Идентификатор Из МассивЗахваченных Цикл
			МассивПорции.Добавить(Идентификатор);
			Если МассивПорции.Количество() >= МаксКоличествоВПорции Тогда
				МассивПорций.Добавить(МассивПорции);
				МассивПорции = Новый Массив;
			КонецЕсли;
		КонецЦикла;

		// Добавить остаток (последняя неполная порция)
		Если МассивПорции.Количество() > 0 Тогда
			МассивПорций.Добавить(МассивПорции);
		КонецЕсли;

	КонецЦикла;

	ПараметрыМенеджера	= ПараметрыМенеджераЗаданий();
	ПараметрыМенеджера.Вставить("ЗапускаемаяПроцедура"	, "AI_ОбработкаСервер.ОбработатьПорциюЗапроса");
	ПараметрыМенеджера.Вставить("НаименованиеЗадания"	, "Обработка запросов к нейросетям");
	ПараметрыМенеджера.Вставить("ПорцииДанных"			, МассивПорций);
	ПараметрыМенеджера.Вставить("КоличествоПотоков"		, КоличествоВсехПотоков);

	РезультатРаботыМенеджера = ОжидатьЗавершенияМенеджераФоновыхЗаданий(ПараметрыМенеджера, 5);

КонецПроцедуры

Процедура ОбогащениеДополнительногоКонтекста() Экспорт

	// Код обогащения
	// Справочник.AI_ДополнительныйКонтекст реквизит "ИдентификаторДляЛогики" - индексирован

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получение параметров для метода ЗапуститьМенеджерФоновыхЗаданий()
Функция ПараметрыМенеджераЗаданий() Экспорт

	ПараметрыМенеджера	= Новый Структура;
	ПараметрыМенеджера.Вставить("ЗапускаемаяПроцедура"	, "");
	ПараметрыМенеджера.Вставить("НаименованиеЗадания"	, "");
	ПараметрыМенеджера.Вставить("ПорцииДанных"			, Новый Массив);
	ПараметрыМенеджера.Вставить("КоличествоПотоков"		, 1);
	ПараметрыМенеджера.Вставить("ИдентификаторФормы"	, Неопределено);

	Возврат ПараметрыМенеджера;

КонецФункции

// Возвращает суммарный расход токенов (входные + выходные + тул) за текущие сутки по провайдеру.
// Учитывает только записи в AI_ЖурналЗапросов, т.е. требует AI_ЛогироватьЗапросы = Истина.
Функция ПолучитьРасходТокеновЗаСегодня(Провайдер) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(AI_ЖурналЗапросов.ВходныеТокены)
		|		+ СУММА(AI_ЖурналЗапросов.ВыходныеТокены)
		|		+ СУММА(AI_ЖурналЗапросов.ТулТокены) КАК Всего
		|ИЗ
		|	РегистрСведений.AI_ЖурналЗапросов КАК AI_ЖурналЗапросов
		|ГДЕ
		|	AI_ЖурналЗапросов.Период >= &НачалоДня
		|	И AI_ЖурналЗапросов.Период < &НачалоСлДня
		|	И AI_ЖурналЗапросов.Провайдер = &Провайдер";

	НачалоТекущегоДня = НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НачалоДня",   НачалоТекущегоДня);
	Запрос.УстановитьПараметр("НачалоСлДня", НачалоТекущегоДня + 86400);
	Запрос.УстановитьПараметр("Провайдер",   Провайдер);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Всего <> Null Тогда
		Возврат Выборка.Всего;
	КонецЕсли;
	Возврат 0;

КонецФункции

// Функция управляет очередями обработки данных для фоновых заданий
// Механиз работы:
// Три ключевых параметра:
//		1. ЗапускаемаяПроцедура - процедура которая будет запущена в фоновом задании
//		2. ПорцииДанных - массив с параметрами (порциями данных) для каждого фонового задания
//		3. КоличествоПотоков - Максимальное количество одновременно работающих потоков для обработки
// Если количество порций данных больше чем параметр "КоличествоПотоков", метод ждет освобождения потока
// и запускает фоновое задание по еще не обработанной порции данных, и так, до обработки всех порций.
// Параметры:
// ПараметрыМенеджера	-	Структура	- полученная методом ПараметрыМенеджераЗаданий() и заполненных для обработки
// ДлительностьПаузы	-	Число		- Длительность паузы ожидания освобождения потока
Функция ОжидатьЗавершенияМенеджераФоновыхЗаданий(ПараметрыМенеджера, ДлительностьПаузы = 20, ПоследнийПакетЗапускатьОтдельно = Ложь) Экспорт

	ЗапускаемаяПроцедура		= ПараметрыМенеджера.ЗапускаемаяПроцедура;
	НаименованиеЗадания			= ПараметрыМенеджера.НаименованиеЗадания;
	ПорцииДанных				= ПараметрыМенеджера.ПорцииДанных;
	КоличествоПотоков			= ПараметрыМенеджера.КоличествоПотоков;

	Если ПараметрыМенеджера.Свойство("ИдентификаторФормы") Тогда
		ГлавныйИдентификаторЗаданий	= ПараметрыМенеджера.ИдентификаторФормы;
	Иначе
		ГлавныйИдентификаторЗаданий = Новый УникальныйИдентификатор;
	КонецЕсли;

	ЗапущенныеФоновыеЗадания	= Новый Массив;

	// Разворот массива. Необходим для правильного удаления значений из массива порций, с сохранением порядка переданного разработчиком
	ИтоговыеПорции = Новый Массив;

	Индекс = ПорцииДанных.ВГраница();
	Пока Индекс <> -1 Цикл
		ИтоговыеПорции.Добавить(ПорцииДанных[Индекс]);
		Индекс = Индекс - 1;
	КонецЦикла;

	ИндексПартии = ПорцииДанных.ВГраница();

	Пока ИтоговыеПорции.Количество() > 0 ИЛИ ЗапущенныеФоновыеЗадания.Количество() > 0 Цикл

		// Если все выделенные потоки на задание заняты или если не осталось необработанных порций данных
		Если ЗапущенныеФоновыеЗадания.Количество() = КоличествоПотоков Или ИтоговыеПорции.Количество() = 0
			//Проверка для последнего пакета, т.к. он должен запустить только когда закончились все предыдущие
			ИЛИ (ПоследнийПакетЗапускатьОтдельно И ИндексПартии = 0 И Не ЗапущенныеФоновыеЗадания.Количество() = 0)
			Тогда

			// Проверка заданий на выполненность
			Индекс = ЗапущенныеФоновыеЗадания.ВГраница();
			Пока Индекс >= 0 Цикл

				Попытка
					ЗаданиеВыполнено = ЗаданиеВыполнено(ЗапущенныеФоновыеЗадания[Индекс]);

				Исключение
					ТекстОшибки			= ОписаниеОшибки();
					ЗаданиеВыполнено	= Истина;

					ЗаписьЖурналаРегистрации(ЗапускаемаяПроцедура, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
				КонецПопытки;

				Если ЗаданиеВыполнено Тогда
					ЗапущенныеФоновыеЗадания.Удалить(Индекс);
				КонецЕсли;

				Индекс = Индекс - 1;
			КонецЦикла;

			// Если ни одно задание еще не выполнилось или если все порции в обработке и просто ожидаем завершения всех заданий
			Если ЗапущенныеФоновыеЗадания.Количество() = КоличествоПотоков ИЛИ (ЗапущенныеФоновыеЗадания.Количество() > 0 И ИтоговыеПорции.Количество() = 0) Тогда
				Пауза(ДлительностьПаузы);
			КонецЕсли;

			ИндексПартии = ИтоговыеПорции.ВГраница();

		//Проверка что пакеты для запуска не закончились + условие для НЕзапуска последнего пакета
		ИначеЕсли (ИндексПартии <> -1 И Не (ПоследнийПакетЗапускатьОтдельно И ИндексПартии = 0))
			//Условие для запуска последнего пакета.
			ИЛИ (ПоследнийПакетЗапускатьОтдельно И ИндексПартии = 0 И ЗапущенныеФоновыеЗадания.Количество() = 0)
			Тогда

			Задание = ВыполнитьВФоне(ЗапускаемаяПроцедура, ИтоговыеПорции[ИндексПартии], НаименованиеЗадания);

			// Удаление уже обрабатывающейся порции данных
			УдалитьЗначениеИзМассива(ИтоговыеПорции, ИтоговыеПорции[ИндексПартии]);

			ЗапущенныеФоновыеЗадания.Добавить(Задание.УникальныйИдентификатор);

			ИндексПартии = ИндексПартии - 1;

		КонецЕсли;

	КонецЦикла;

КонецФункции

Процедура УдалитьЗначениеИзМассива(Массив, Значение) Экспорт

	Индекс = Массив.Найти(Значение);
	Если Индекс <> Неопределено Тогда
		Массив.Удалить(Индекс);
	КонецЕсли;

КонецПроцедуры

Процедура AI_RAG_ПередЗаписьюПриЗаписи(Источник, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.ПоставитьСсылкуВОчередь(Источник.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура Пауза(Секунд) Экспорт

    ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
    ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();

    Если ФоновоеЗадание = Неопределено Тогда
        Параметры = Новый Массив;
        Параметры.Добавить(Секунд);
        ФоновоеЗадание = ФоновыеЗадания.Выполнить("AI_ОбработкаСервер.Пауза", Параметры);
    КонецЕсли;

    Попытка
        ФоновоеЗадание.ОжидатьЗавершения(Секунд);
    Исключение
        Возврат;
    КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПорциюЗапроса(ИдентификаторыСообщений) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_ОчередьЗапросов.Дата КАК Дата,
		|	AI_ОчередьЗапросов.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	AI_ОчередьЗапросов.Провайдер КАК Провайдер,
		|	AI_ОчередьЗапросов.ТипAPI КАК ТипAPI,
		|	AI_ОчередьЗапросов.Модель КАК Модель,
		|	AI_ОчередьЗапросов.AI_Агент КАК AI_Агент,
		|	AI_ОчередьЗапросов.AI_Агент.ИдентификаторДляЛогики КАК ИдентификаторДляЛогики,
		|	AI_ОчередьЗапросов.Промт КАК Промт,
		|	AI_ОчередьЗапросов.ИмяВложения КАК ИмяВложения,
		|	AI_ОчередьЗапросов.Вложение КАК Вложение
		|ИЗ
		|	РегистрСведений.AI_ОчередьЗапросов КАК AI_ОчередьЗапросов
		|ГДЕ
		|	AI_ОчередьЗапросов.УникальныйИдентификатор В(&СписокИдентификаторов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";

	Запрос.УстановитьПараметр("СписокИдентификаторов", ИдентификаторыСообщений);

	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		РезультатОбработки = ВыполнитьОбращениеККлиентуИзОчереди(Результат);

		Если РезультатОбработки.Ошибка Тогда
			Если РезультатОбработки.ЭтоЛимитОбращений Тогда
				// 429: временная перегрузка провайдера — не тратим попытку
				РегистрыСведений.AI_ОчередьЗапросов.ВернутьВОчередьБезОшибки(
					Результат.УникальныйИдентификатор);
				ЗаписьЖурналаРегистрации("AI_ОчередьЗапросов",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					СтрШаблон("Лимит запросов провайдера (429), запись [%1] возвращена в очередь: %2",
						Результат.УникальныйИдентификатор, РезультатОбработки.ОписаниеОшибки));
			Иначе
				РегистрыСведений.AI_ОчередьЗапросов.ЗафиксироватьОшибкуОбработки(
					Результат.УникальныйИдентификатор, РезультатОбработки.ОписаниеОшибки);
			КонецЕсли;
		Иначе
			AI_ДействияПослеОбработки.ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки);
			РегистрыСведений.AI_ОчередьЗапросов.УдалитьЗапросИзОчереди(Результат.УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПараметрыРезультатаОбработки()

	Параметры = Новый Структура;
	Параметры.Вставить("Ошибка", Ложь);
	Параметры.Вставить("ЭтоЛимитОбращений", Ложь);
	Параметры.Вставить("ОписаниеОшибки", "");
	Параметры.Вставить("ОтветСтрокой", "");
	Параметры.Вставить("Ответ", Неопределено);
	Параметры.Вставить("ИдентификаторДляЛогики", "");

	Возврат Параметры;

КонецФункции

Функция ВыполнитьОбращениеККлиентуИзОчереди(ВыборкаОчереди)

	Результат = ПараметрыРезультатаОбработки();
	Результат.ИдентификаторДляЛогики = ВыборкаОчереди.ИдентификаторДляЛогики;

	Попытка
		Клиент = Обработки.AI_Клиент.Создать();
		Клиент.Инициализировать(ВыборкаОчереди.Провайдер, ВыборкаОчереди.Модель, ВыборкаОчереди.ТипAPI);
		Клиент.ИнициализироватьСистемныйПромт(ВыборкаОчереди.AI_Агент);
		Клиент.УстановитьИДЗапроса(ВыборкаОчереди.УникальныйИдентификатор);

		Промт = ВыборкаОчереди.Промт;

		Если ЗначениеЗаполнено(ВыборкаОчереди.ИмяВложения) Тогда
			// НЕ проверена работоспособность
			ДвоичныеДанные = ВыборкаОчереди.Вложение.Получить();
			Клиент.СпроситьСКартинкой(Промт, ВыборкаОчереди.ИмяВложения, ДвоичныеДанные);
		Иначе
			Клиент.Спросить(Промт);
		КонецЕсли;

		// Проверяем наличие ошибки в ответе провайдера (HTTP-ошибка без исключения, напр. 429)
		Если ЗначениеЗаполнено(Клиент.ОшибкаОбработки) Тогда
			ВызватьИсключение Клиент.ОшибкаОбработки;
		КонецЕсли;

		Клиент.ПреобразоватьОтветВСтроку();
		Клиент.ИзвлечьОтвет();

	Исключение
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		Результат.ЭтоЛимитОбращений = ЭтоОшибкаЛимитаОбращений(Результат.ОписаниеОшибки);
		Возврат Результат;
	КонецПопытки;

	Результат.ОтветСтрокой = Клиент.ИзвлеченныйОтвет;

	Попытка
		Если Клиент.ИзвлекатьОтветВСтруктуру Тогда
			Клиент.ИзвлечьОтвет(Истина);
		КонецЕсли;
		Результат.Ответ = Клиент.ИзвлеченныйОтвет;
	Исключение
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = СтрШаблон("При преобразовании ответа [%1] в структуру произошла ошибка: %2%3",
												Результат.ОтветСтрокой,
												Символы.ПС,
												ОписаниеОшибки());
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ЗаданиеВыполнено(ИдентификаторЗадания)

	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		ВызватьИсключение "Задания по идентификатору не найдено.";
	КонецЕсли;

	ЗаданиеЗавершено = НЕ Задание.Состояние = СостояниеФоновогоЗадания.Активно;

	Возврат ЗаданиеЗавершено;

КонецФункции

Функция ВыполнитьВФоне(ЗапускаемаяПроцедура, Порция, ИмяЗадания)
	Возврат ФоновыеЗадания.Выполнить(ЗапускаемаяПроцедура, Порция, Новый УникальныйИдентификатор, ИмяЗадания);
КонецФункции

Процедура ВернутьЗависшиеЗаписи()

	ТаймаутМинут = 60;
	ГраницаВремени = ТекущаяДатаСеанса() - ТаймаутМинут * 60;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_ОчередьЗапросов.УникальныйИдентификатор КАК УникальныйИдентификатор
		|ИЗ
		|	РегистрСведений.AI_ОчередьЗапросов КАК AI_ОчередьЗапросов
		|ГДЕ
		|	AI_ОчередьЗапросов.Статус = &СтатусВОбработке
		|	И AI_ОчередьЗапросов.ДатаНачалаОбработки <= &ГраницаВремени";

	Запрос.УстановитьПараметр("СтатусВОбработке", Перечисления.AI_СтатусОчереди.ВОбработке);
	Запрос.УстановитьПараметр("ГраницаВремени", ГраницаВремени);

	КоличествоСброшенных = 0;
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.AI_ОчередьЗапросов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УникальныйИдентификатор = Результат.УникальныйИдентификатор;
		МенеджерЗаписи.Прочитать();
		// Повторная проверка статуса — защита от гонки при одновременном вызове
		Если МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.ВОбработке Тогда
			МенеджерЗаписи.Статус = Перечисления.AI_СтатусОчереди.Новый;
			МенеджерЗаписи.ДатаНачалаОбработки = '00010101000000';
			МенеджерЗаписи.Записать(Истина);
			КоличествоСброшенных = КоличествоСброшенных + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоСброшенных > 0 Тогда
		ЗаписьЖурналаРегистрации(
			"AI_ОчередьЗапросов",
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			СтрШаблон("Возвращено в очередь зависших записей: %1 (таймаут %2 мин.)",
				КоличествоСброшенных, ТаймаутМинут));
	КонецЕсли;

КонецПроцедуры

// Определяет, является ли ошибка ограничением частоты запросов провайдера (HTTP 429).
// Проверяет текст ошибки на признаки rate-limit от OpenAI, Yandex, Ollama и совместимых API.
Функция ЭтоОшибкаЛимитаОбращений(ТекстОшибки)
	НижнийРегистр = НРег(ТекстОшибки);
	Возврат СтрНайти(НижнийРегистр, "429") > 0
		ИЛИ СтрНайти(НижнийРегистр, "rate_limit") > 0
		ИЛИ СтрНайти(НижнийРегистр, "too many requests") > 0
		ИЛИ СтрНайти(НижнийРегистр, "requests_per_minute") > 0
		ИЛИ СтрНайти(НижнийРегистр, "resource_exhausted") > 0;
КонецФункции

Процедура AI_КонтрольУникальностиИдентификатораЛогикиПередЗаписью(Источник, Отказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Наименование КАК Наименование
		|ИЗ
		|	Справочник.AI_Модели КАК Таблица
		|ГДЕ
		|	НЕ Таблица.Ссылка = &Ссылка
		|	И Таблица.ИдентификаторДляЛогики = &ИдентификаторДляЛогики";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "AI_Модели", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).Имя);

	Запрос.УстановитьПараметр("ИдентификаторДляЛогики", Источник.ИдентификаторДляЛогики);
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);

	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
		Сообщить(СтрШаблон("Данный идентификатор используется в элементе [%1]. Продолжение не возможно.", Источник.Ссылка));
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
